Examinator/src/Catalogs/РазделыФорумаСУО/РазделыФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазделыФорумаСУО</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Видимость</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Модератор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОН/ДанныеВебКабинетаСУО_ОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ОН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПН/ДанныеВебКабинетаСУО_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ФотографииПользователейСУО/ФотографииПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФотографииПользователейСУО</name>
  <resources>
    <name>ЕстьАватар</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Аватар</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СообщенияТемСУО/СообщенияТемСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияТемСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>РазделФорума</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиТемФорумаСУО/НастройкиТемФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТемФорумаСУО</name>
  <attributes>
    <name>РазделФорума</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ТемыСообщенийСУО/ТемыСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТемыСообщенийСУО</name>
  <attributes>
    <name>Кому</name>
    <type>
      <types>EnumRef.АдресатыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.ОрганизаторыСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключенныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/РазделыФорумаСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция Участники(РазделФорума) Экспорт

	ДляВсех = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделФорума, "ДляВсех");
	
	Если ДляВсех Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Ссылка КАК Пользователь
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.ПометкаУдаления = ЛОЖЬ
			|	И Пользователи.Недействителен = ЛОЖЬ";

		Результат = Запрос.Выполнить();

		ТаблицаУчастников = Результат.Выгрузить();
		
	Иначе
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РазделыФорумаСУОВидимость.Пользователь
			|ИЗ
			|	Справочник.РазделыФорумаСУО.Видимость КАК РазделыФорумаСУОВидимость
			|ГДЕ
			|	РазделыФорумаСУОВидимость.Ссылка = &РазделФорума";

		Запрос.УстановитьПараметр("РазделФорума", РазделФорума);

		Результат = Запрос.Выполнить();

		ТаблицаУчастников = Результат.Выгрузить();
		
		АвторРаздела = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделФорума, "Автор");
		
		Если ЗначениеЗаполнено(АвторРаздела) И ТаблицаУчастников.Найти(АвторРаздела, "Пользователь") = Неопределено Тогда
			
			НоваяСтрока = ТаблицаУчастников.Добавить();
			
			НоваяСтрока.Пользователь = АвторРаздела;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаУчастников;
	
КонецФункции

Функция РазделыПользователя(Знач Пользователь = Неопределено, Дерево = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазделыФорумаСУО.Ссылка,
		|	РазделыФорумаСУО.Наименование,
		|	РазделыФорумаСУО.Видимость.(
		|		Пользователь,
		|		Модератор
		|	),
		|	РазделыФорумаСУО.Автор
		|ИЗ
		|	Справочник.РазделыФорумаСУО КАК РазделыФорумаСУО
		|ГДЕ
		|	(РазделыФорумаСУО.Автор = &Пользователь
		|			ИЛИ РазделыФорумаСУО.Видимость.Пользователь = &Пользователь
		|			ИЛИ РазделыФорумаСУО.ДляВсех = ИСТИНА)
		|	И РазделыФорумаСУО.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазделыФорумаСУО.РеквизитДопУпорядочивания ИЕРАРХИЯ";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	РезультатЗапроса = Запрос.Выполнить();

	Если Дерево Тогда	
		Возврат РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);		
	Иначе		
		Возврат РезультатЗапроса.Выгрузить();		
	КонецЕсли;	
		
КонецФункции

Функция ЕстьПравоСоздаватьТемыФорума(Знач Пользователь, Знач РазделФорума) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазделыФорумаСУО.Ссылка
		|ИЗ
		|	Справочник.РазделыФорумаСУО КАК РазделыФорумаСУО
		|ГДЕ
		|	РазделыФорумаСУО.Ссылка = &РазделФорума
		|	И РазделыФорумаСУО.Автор = &Пользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РазделыФорумаСУОВидимость.Ссылка
		|ИЗ
		|	Справочник.РазделыФорумаСУО.Видимость КАК РазделыФорумаСУОВидимость
		|ГДЕ
		|	РазделыФорумаСУОВидимость.Пользователь = &Пользователь
		|	И РазделыФорумаСУОВидимость.Ссылка = &РазделФорума
		|	И РазделыФорумаСУОВидимость.Модератор = ИСТИНА";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(РазделФорума, ДополнительныеДанные = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РазделФорумаОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РазделФорума, "ПометкаУдаления, ДляВсех");
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(РазделФорума, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума);	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(РазделФорума, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума);
	
	Если НЕ РазделФорумаОбъект.ПометкаУдаления Тогда

		ОписаниеРазделаJSON = РазделJSON(РазделФорума);			
		
		ПользователиРаздела = ПользователиРаздела(РазделФорума);
			
		Если ПользователиРаздела.Количество() = 0 Тогда			
			РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума, РазделФорума, ОписаниеРазделаJSON, Перечисления.ФорматыВебДанныхСУ.json);			
		Иначе			
			Для каждого Пользователь Из ПользователиРаздела Цикл
				РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума, РазделФорума, ОписаниеРазделаJSON, Перечисления.ФорматыВебДанныхСУ.json);
			КонецЦикла;			
		КонецЕсли;
		
	КонецЕсли;
	
	// Обновляем подчиненные разделы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазделыФорумаСУО.Ссылка
		|ИЗ
		|	Справочник.РазделыФорумаСУО КАК РазделыФорумаСУО
		|ГДЕ
		|	РазделыФорумаСУО.Ссылка В ИЕРАРХИИ(&РазделФорума)
		|	И РазделыФорумаСУО.Ссылка <> &РазделФорума";
	
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбновитьДанныеВебКабинета(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Функция МодераторыРаздела(РазделФорума) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазделыФорумаСУО.Автор КАК Пользователь,
		|	ФотографииПользователейСУО.ЕстьАватар КАК ЕстьАватар,
		|	РазделыФорумаСУО.Автор.Наименование КАК НаименованиеПользователя
		|ИЗ
		|	Справочник.РазделыФорумаСУО КАК РазделыФорумаСУО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФотографииПользователейСУО КАК ФотографииПользователейСУО
		|		ПО РазделыФорумаСУО.Автор = ФотографииПользователейСУО.Пользователь
		|ГДЕ
		|	РазделыФорумаСУО.Ссылка = &РазделФорума
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РазделыФорумаСУОВидимость.Пользователь,
		|	ФотографииПользователейСУО.ЕстьАватар,
		|	РазделыФорумаСУОВидимость.Пользователь.Наименование
		|ИЗ
		|	Справочник.РазделыФорумаСУО.Видимость КАК РазделыФорумаСУОВидимость
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФотографииПользователейСУО КАК ФотографииПользователейСУО
		|		ПО РазделыФорумаСУОВидимость.Пользователь = ФотографииПользователейСУО.Пользователь
		|ГДЕ
		|	РазделыФорумаСУОВидимость.Ссылка = &РазделФорума
		|	И РазделыФорумаСУОВидимость.Модератор = ИСТИНА";
	
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция РазделJSON(РазделФорума) Экспорт
	
	ОписаниеРаздела = Новый Структура("Наименование, Идентификатор, Родитель, Номер, Тип, Модераторы");
	
	ОписаниеРаздела.Идентификатор = Строка(РазделФорума.УникальныйИдентификатор());
	ОписаниеРаздела.Модераторы = Новый Массив;
	
	Если ТипЗнч(РазделФорума) = Тип("СправочникСсылка.РазделыФорумаСУО") Тогда
	
		ДанныеРаздела = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РазделФорума, "Наименование, Родитель, РеквизитДопУпорядочивания");
		
		ОписаниеРаздела.Наименование = ДанныеРаздела.Наименование;
		ОписаниеРаздела.Родитель = Строка(ДанныеРаздела.Родитель.УникальныйИдентификатор());
		ОписаниеРаздела.Номер = ДанныеРаздела.РеквизитДопУпорядочивания;
		ОписаниеРаздела.Тип = "forum";		
		
		ТаблицаМодераторов = МодераторыРаздела(РазделФорума);
		
		Для каждого СтрокаТМ Из ТаблицаМодераторов Цикл
			
			ЕстьАватар = ?(ТипЗнч(СтрокаТМ.ЕстьАватар) = Тип("Булево"), СтрокаТМ.ЕстьАватар, Ложь);
			
			ОписаниеМодератора = ВебКабинетСУО.ПользовательСтруктура(
				СтрокаТМ.Пользователь, СтрокаТМ.НаименованиеПользователя, ЕстьАватар);
				
			ОписаниеРаздела.Модераторы.Добавить(ОписаниеМодератора);
				
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(РазделФорума) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		
		ОписаниеРаздела.Наименование = Документы.ПроведениеОбученияСУО.НаименованиеОбучения(РазделФорума);
		ОписаниеРаздела.Тип = "education";
		ОписаниеРаздела.Родитель = "00000000-0000-0000-0000-000000000000";
		
	КонецЕсли;
	
	Если ТипЗнч(РазделФорума) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		
		ОписаниеРаздела.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделФорума, "ПрограммаОбучения.Наименование");
		ОписаниеРаздела.Тип = "programmEducation";
		ОписаниеРаздела.Родитель = "00000000-0000-0000-0000-000000000000";
		
	КонецЕсли;
	
	Если ТипЗнч(РазделФорума) = Тип("СправочникСсылка.УчебныеГруппыСУО")
		ИЛИ ТипЗнч(РазделФорума) = Тип("СправочникСсылка.УчебныеГруппыОО") Тогда
		
		ОписаниеРаздела.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделФорума, "Наименование");
		ОписаниеРаздела.Тип = "eduGroup";
		ОписаниеРаздела.Родитель = "00000000-0000-0000-0000-000000000000";
		
	КонецЕсли;
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
КонецФункции

Функция РазделОписаниеОбщееJSON(РазделФорума) Экспорт
	
	// КоличествоСообщений
	
	КоличествоСообщений = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СообщенияТемСУО.Регистратор) КАК КоличествоСообщений
		|ИЗ
		|	РегистрСведений.СообщенияТемСУО КАК СообщенияТемСУО
		|ГДЕ
		|	СообщенияТемСУО.РазделФорума = &РазделФорума";
	
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();

		КоличествоСообщений = ВыборкаДетальныеЗаписи.КоличествоСообщений;
		
	КонецЕсли;
		
	// КоличествоТем
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ТемыСообщенийСУО.Ссылка) КАК КоличествоТем
		|ИЗ
		|	Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
		|ГДЕ
		|	ТемыСообщенийСУО.Контекст = &РазделФорума
		|	И ТемыСообщенийСУО.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	КоличествоТем = ВыборкаДетальныеЗаписи.КоличествоТем;
	
	// ПоследнееСообщение
	
	ПоследнееСообщение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СообщенияТемСУОСрезПоследних.Регистратор КАК Сообщение
		|ИЗ
		|	РегистрСведений.СообщенияТемСУО.СрезПоследних(, РазделФорума = &РазделФорума) КАК СообщенияТемСУОСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	СообщенияТемСУОСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ПоследнееСообщение = Документы.СообщениеСУО.СообщениеСтруктура(ВыборкаДетальныеЗаписи.Сообщение);
		
	КонецЕсли;
	
	// Описание
	
	ОписаниеРаздела = Новый Структура("ПоследнееСообщение, КоличествоСообщений, КоличествоТем", ПоследнееСообщение, КоличествоСообщений, КоличествоТем);
	ОписаниеРаздела	= ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
	Возврат ОписаниеРаздела;
	
КонецФункции

Функция РазделОписаниеПользовательскоеJSON(РазделФорума, Пользователь) Экспорт
	
	// ДатаПросмотра
	
	ДатаПросмотра = Дата("00010101");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиТемФорумаСУО.ДатаПросмотра КАК ДатаПросмотра
		|ИЗ
		|	РегистрСведений.НастройкиТемФорумаСУО КАК НастройкиТемФорумаСУО
		|ГДЕ
		|	НастройкиТемФорумаСУО.Пользователь = &Пользователь
		|	И НастройкиТемФорумаСУО.РазделФорума = &РазделФорума
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПросмотра УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		ВыборкаДетальныеЗаписи.Следующий();
		
		ДатаПросмотра = ВыборкаДетальныеЗаписи.ДатаПросмотра;
		
	КонецЕсли;
	
	// Результат
	
	ОписаниеРаздела = Новый Структура("ДатаПросмотра", ДатаПросмотра);
	ОписаниеРаздела	= ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
	Возврат ОписаниеРаздела;	
	
КонецФункции

Функция ПользователиРаздела(Раздел)
	
	МассивПользователей = Новый Массив;
	
	// Получаем всех родителей раздела (в массив входит сам раздел)
	
	МассивРодителей = Новый Массив;
	
	РодителиРаздела(Раздел, МассивРодителей);
	
	// Получаем всех пользователей разделов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазделыФорумаСУОВидимость.Пользователь,
		|	РазделыФорумаСУОВидимость.Ссылка КАК Раздел
		|ИЗ
		|	Справочник.РазделыФорумаСУО.Видимость КАК РазделыФорумаСУОВидимость
		|ГДЕ
		|	РазделыФорумаСУОВидимость.Ссылка В(&МассивРодителей)
		|	И РазделыФорумаСУОВидимость.Ссылка.ДляВсех = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("МассивРодителей", МассивРодителей);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивПользователей; // Общий раздел		
	КонецЕсли;
	
	// Получаем пользователей, которые имеют право просматривать раздел
	
	ТаблицаПользователейРазделов      = РезультатЗапроса.Выгрузить();
	МассивВсехПользователей           = Новый Массив;
	МассивРазделовСПользователями     = Новый Массив;
	
	Для каждого Строка Из ТаблицаПользователейРазделов Цикл
	
		Если МассивВсехПользователей.Найти(Строка.Пользователь) = Неопределено Тогда
			МассивВсехПользователей.Добавить(Строка.Пользователь);	
		КонецЕсли;
		
		Если МассивРазделовСПользователями.Найти(Строка.Раздел) = Неопределено Тогда
			МассивРазделовСПользователями.Добавить(Строка.Раздел);
		КонецЕсли;
	
	КонецЦикла;
	
	КоличествоРазделовСПользователями = МассивРазделовСПользователями.Количество();
	
	// Подходят только тех пользователей, которые указаны во всех разделах с пользователями.
	
	Для каждого Пользователь Из МассивВсехПользователей Цикл
	
		РазделыПользователя = ТаблицаПользователейРазделов.НайтиСтроки(Новый Структура("Пользователь", Пользователь));
		
		Если РазделыПользователя.Количество() = КоличествоРазделовСПользователями Тогда
			МассивПользователей.Добавить(Пользователь);	
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат МассивПользователей;
	
КонецФункции

// Возвращает массив родителей раздела, включая сам раздел
//
Процедура РодителиРаздела(Знач Раздел, МассивРодителей)
	
	МассивРодителей.Добавить(Раздел);
	
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Раздел, "Родитель");
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		РодителиРаздела(Родитель, МассивРодителей);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
